def sudoku(board):
    # Перебор строк доски
    for row in board:
        dub = set()  # Переменная для отслеживания новый значений
        for num in row:  # Перебор каждого символа в списке
            if num != '.':  # Не учитываем точки при переборе
                if num in dub:  # Если число уже встречалось, возвращаем False
                    return False

    # Перебор столбцов доски
    for col in range(9):
        dub = set()  # Переменная для отслеживания новый значений
        for row in range(9): # Перебор строк внутри столбцов
            num = board[row][col] # отображение столбца
            if num != '.':  # Исключаем точки из рассмотрения
                if num in dub:  # Если число уже встречалось в этом столбце,
                    # возвращаем False
                    return False

    # Перебор подполей 3x3 доски
    for i in range(0, 9, 3):
        for j in range(0, 9, 3): # перебор каждого поля 3x3
            dub = set() # Переменная для отслеживания новыx значений в подполе 3x3

            # Перебор ячеек внутри текущего подполя 3x3
            for x in range(i, i + 3):
                for y in range(j, j + 3):
                    num = board[x][y] # Получаем значение ячейки в текущем подполе
                    if num != '.':  # Не учитываем точки при переборе
                        if num in dub: # Если число уже встречалось,
                            # возвращаем False
                            return False
                        dub.add(num)  # отслеживания уникальных значений в
                        # каждом подполе 3х3

    return True  # Если все проверки пройдены, возвращаем True - доска
    # действительна


# Пример использования:
board1 = [
    ["5", "3", ".", ".", "7", ".", ".", ".", "."],
    ["6", ".", ".", "1", "9", "5", ".", ".", "."],
    [".", "9", "8", ".", ".", ".", ".", "6", "."],
    ["8", ".", ".", ".", "6", ".", ".", ".", "3"],
    ["4", ".", ".", "8", ".", "3", ".", ".", "1"],
    ["7", ".", ".", ".", "2", ".", ".", ".", "6"],
    [".", "6", ".", ".", ".", ".", "2", "8", "."],
    [".", ".", ".", "4", "1", "9", ".", ".", "5"],
    [".", ".", ".", ".", "8", ".", ".", "7", "9"]
]

board2 = [
    ["8", "3", ".", ".", "7", ".", ".", ".", "."],
    ["6", ".", ".", "1", "9", "5", ".", ".", "."],
    [".", "9", "8", ".", ".", ".", ".", "6", "."],
    ["8", ".", ".", ".", "6", ".", ".", ".", "3"],
    ["4", ".", ".", "8", ".", "3", ".", ".", "1"],
    ["7", ".", ".", ".", "2", ".", ".", ".", "6"],
    [".", "6", ".", ".", ".", ".", "2", "8", "."],
    [".", ".", ".", "4", "1", "9", ".", ".", "5"],
    [".", ".", ".", ".", "8", ".", ".", "7", "9"]
]

print(sudoku(board1))  # Вывод: True
print(sudoku(board2))  # Вывод: False
